In [1]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

In [22]:
result = df['대여일자'].value_counts().to_frame()
result[result['대여일자'] == result['대여일자'].max()].index[0]

'2021-06-04'

In [33]:
df['대여일자'] = df['대여일자'].apply(pd.to_datetime)

In [36]:
df['day_name'] = df['대여일자'].dt.day_name()

In [40]:
df['day_name'].value_counts().to_frame()

           day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977

In [63]:
df.groupby(['day_name', '대여소번호']).size().to_frame('size').sort_values(['day_name', 'size'], ascending=False).reset_index().drop_duplicates('day_name').reset_index(drop=True)

    day_name  대여소번호  size
0  Wednesday    502   282
1    Tuesday    502   267
2   Thursday   2715   137
3     Sunday    502   372
4   Saturday    502   378
5     Monday    502   242
6     Friday    502   277

In [73]:
filt = df['대여구분코드'].isin(['일일권', '일일권(비회원)'])
daily = df[filt]['연령대코드'].value_counts().sort_index()
total = df['연령대코드'].value_counts().sort_index()

In [74]:
ratio = (daily / total).sort_values(ascending=False)

In [75]:
ratio

~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
Name: 연령대코드, dtype: float64

In [79]:
ratio.index[0]

'~10대'

In [83]:
df[['연령대코드', '이동거리']].groupby('연령대코드').mean()

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

In [84]:
data = df[df['연령대코드'] == '20대']

In [85]:
data2 = data[data['이동거리'] >= data['이동거리'].mean()]

In [88]:
data3 = data2.sort_values(['대여일자', '대여소번호'], ascending=False)

In [96]:
data3['탄소량'] = data3['탄소량'].astype('float')

In [101]:
print(f"{data3['탄소량'].head(200).mean():.3f}")

1.613

In [104]:
filt = (df['대여일자'] == '2021-06-07') & (df['연령대코드'] == '~10대')

In [106]:
df[filt]['이용건수'].median()

1.0

In [107]:
df

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,day_name
0,2021-06-01,0,3541,정기권,F,~10대,1,0.00,0.00,0.00,8,Tuesday
1,2021-06-01,0,765,정기권,F,~10대,1,27.21,0.35,1526.81,19,Tuesday
2,2021-06-01,0,2637,정기권,F,~10대,1,41.40,0.37,1608.56,18,Tuesday
3,2021-06-01,0,2919,정기권,F,~10대,1,0.00,0.00,0.00,75,Tuesday
4,2021-06-01,0,549,정기권,F,~10대,1,13.04,0.17,731.55,6,Tuesday
...,...,...,...,...,...,...,...,...,...,...,...,...
678945,2021-06-14,23,4623,정기권,M,60대,1,32.92,0.30,1279.01,37,Monday
678946,2021-06-14,23,2331,정기권,M,60대,1,11.88,0.09,400.00,4,Monday
678947,2021-06-14,23,722,정기권,M,60대,1,53.28,0.48,2070.00,20,Monday
678948,2021-06-14,23,3787,정기권,M,70대~,1,121.25,1.18,5103.30,86,Monday
678949,2021-06-14,23,1911,정기권,M,70대~,1,42.18,0.38,1638.70,28,Monday

In [123]:
filt = (~df['day_name'].isin(['Saturday', 'Sunday'])) & (df['대여시간'].isin([6, 7, 8]))

In [125]:
df[filt].groupby(['대여시간', '대여소번호'])['이용건수'].sum().to_frame('이용 횟수').sort_values(['대여시간', '이용 횟수'], ascending=False).groupby('대여시간').head(3)

            이용 횟수
대여시간 대여소번호
8    2701     360
     2715     155
     646      151
7    259      184
     2744     125
     2733     104
6    2744      55
     1028      47
     1125      44

In [127]:
filt = (df['이동거리']) >= (df['이동거리'].mean())

In [129]:
df[filt]['이동거리'].std()

5092.139707505305

In [130]:
df['성별'] = df['성별'].str.lower()

In [132]:
df['성별'] = df['성별'].apply(lambda x:'남' if x == 'm' else '여')

In [136]:
df[['성별', '이동거리']].groupby('성별').mean()

           이동거리
성별
남   3209.110871
여   3468.575025